var map = L.map('map', {
  center: [24.041901169872627, 121.69285748577341],
  zoom: 18
});

L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
  attribution: '&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
}).addTo(map);

L.marker([24.038001169872627, 121.59043248577341]).addTo(map)
.bindPopup('<h1>柴油糟雷達波液位計192.168.2.66</h1></p>')
.openPopup();

L.marker([24.038511169872627, 121.59094248567341]).addTo(map)
.bindPopup('<h1>一號光纖箱</h1></p><h2>MOV: 192.168.127.61 #1#2#5油槽</p>鍋爐房光纖線路: 192.168.2.66</P>監視設備:</p>192.168.1.13舊品堆置場</p>192.168.1.15報廢車輛置放</p>192.168.1.16A幹道往東</p>192.168.1.62行政倉庫前</p>192.168.1.63行政倉庫後</p>192.168.1.90集水坑1</p>192.168.1.91集水坑2</p></h2>')
.openPopup();

L.marker([24.039691169872627, 121.59204448567341]).addTo(map)
.bindPopup('<h1>二號光纖箱</p></h1><h2>MOV:192.168.127.63#1#4油槽</p>監視器:</p>192.168.1.49</p>192.68.1.50舊操作室後</p>192.168.1.94集水坑5</p></h2>')
.openPopup();
L.marker([24.03910069872627,121.58929448567341]).addTo(map)
.bindPopup('<h1>三號光纖箱</h1></p><h2>MOV:192.168.127.65#3#6油槽</p>監視器</p>192.168.1.92集水坑3</p>192.168.1.93 集水坑4</p></h2>')
.openPopup();

L.marker([24.040401169872627, 121.59043248577341]).addTo(map)
.bindPopup('<h1>四號光纖箱</h1></p><h2>VOC 192.168.2.9</p>MOV192.168.127.67 #7#8#9油槽</p>監視器</p>192.168.1.96集水坑7</p>192.168.1.97集水坑8</h2>')
.openPopup();

L.marker([24.041441169872627, 121.59133248577341]).addTo(map)
.bindPopup('<h1>五號光纖箱</h1></p><h2>MOV192.168.127.69 #7 #10油槽</p>監視器</p>192.168.1.24輸油管往西</p>192.168.1.28 10號油糟</p>192.168.1.99 集水坑10</p>雷達波液位計192.168.2.21</h2>')
.openPopup();


L.marker([24.041401169872627, 121.58923248577341]).addTo(map)
.bindPopup('<h1>六號光纖箱</h1></p><h2>MOV 192.168.127.71 #9 #11</p>監視器</p>192.168.1.98 集水坑9</p>192.168.1.100 集水坑11</p></h2>')
.openPopup();
L.marker([24.042201169872627, 121.59043248577341]).addTo(map)
.bindPopup('<h1>七號光纖箱</h1></p><h2>MOV192.168.127.73#12 #13油槽</p>VOC</p>192.168.2.12</p>監視器</p>192.168.1.101 集水坑12</h2>')
.openPopup();
L.marker([24.042701169872627, 121.59044248567341]).addTo(map)
.bindPopup('<h1>八號光纖箱</h1></p><h2>VOC192.168.2.15 </p>MOV192.168.127.75#15 #16油槽</p>監視器</p>192.168.1.103 集水坑15</p>192.168.1.104 集水坑16</h2>')
.openPopup();









